CASE_II/Mesh3/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    cellDisplacement
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
        maxIter         100;
    }

    p
    {
        solver          PBiCGStab; // GAMG solver is not supported for pressure. Use PCG or PBiCGStab
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }

    pFinal
    {
        $p;
        relTol		0;
    }

    pcorr
    {
        $p;
        solver          PCG;
        preconditioner  DIC;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    UFinal
    {
        $U;
        //relTol          0;
    }

}

PIMPLE
{

    momentumPredictor   	yes;
    nOuterCorrectors    	4;
    nCorrectors         	4;
    nNonOrthogonalCorrectors 	1;

    pRefPoint			(-0.149 0 0);
    pRefValue           	0.0;
    
    checkMeshCourantNo		yes;
    
}

relaxationFactors
{
   fields
   {
   }
   equations
   {
       //".*"             1;
   }
}


// ************************************************************************* //
